electricalhog/PD_Charger/STM32CubeIDE/final/Core/Inc/regulator_config.h
/**
 * @file    regulator_config.h
 * @brief   Centralized hardware constants, pin mappings, and compile-time
 *          configurable parameters for the buck-boost regulator firmware.
 *
 * This file is the single point of truth for all hardware-derived constants
 * in the firmware (NLSpec §2.1).  Every pin mapping and every numeric constant
 * that comes from the schematic, the datasheet, or a deliberate design choice
 * lives here — NOT scattered across source files.
 *
 * Pin-mapping entry format (§2.1):
 *   - Pin name (schematic net label)
 *   - MCU port/pin identifier
 *   - Net label from schematic
 *   - Physical connection
 *   - Signal direction
 *
 * Constant entry format (§2.1):
 *   - Parameter name
 *   - Units
 *   - Valid range (where applicable)
 *   - Derivation reference
 *
 * Sources of truth (priority order, per spec §Meta):
 *   manual corrections > KiCad schematics > final.ioc > spec answers
 *
 * NLSpec conformance: v0.1.2j
 */

#ifndef REGULATOR_CONFIG_H
#define REGULATOR_CONFIG_H

#include "stm32g4xx_hal.h"

#ifdef __cplusplus
extern "C" {
#endif

/* =========================================================================
 * SECTION 1: ANALOG INPUT PIN MAPPINGS (Voltage and Current Sense)
 * =========================================================================*/

/**
 * VD_MON — Output voltage sense (V_out)
 * MCU pin : PA0 / ADC1_IN1
 * Net     : VD_MON (output.kicad_sch)
 * Physical: 100 kΩ / 5.82 kΩ resistive divider from V_out rail
 * Dir     : Analog input
 * NOTE    : IOC labels PA0 as VS_MON — this is an IOC labeling error.
 *           The schematic (higher priority) confirms PA0 = VD_MON (§2.2).
 */
#define PIN_VD_MON_PORT      GPIOA
#define PIN_VD_MON_PIN       GPIO_PIN_0
#define ADC_CHANNEL_VD_MON   ADC_CHANNEL_1

/**
 * IL_MON — Inductor current sense
 * MCU pin : PA1 / ADC1_IN2 (shared with COMP1_INP)
 * Net     : IL_MON (dc-dc.kicad_sch)
 * Physical: INA281A2 (U7) output; 5 mΩ shunt (R5), 50 V/V gain
 * Dir     : Analog input (also COMP1 non-inverting input)
 */
#define PIN_IL_MON_PORT      GPIOA
#define PIN_IL_MON_PIN       GPIO_PIN_1
#define ADC_CHANNEL_IL_MON   ADC_CHANNEL_2

/**
 * VS_MON_A4 — Input voltage sense (V_in)
 * MCU pin : PA4 / ADC2_IN17
 * Net     : VS_MON (input.kicad_sch)
 * Physical: 100 kΩ / 5.82 kΩ resistive divider from V_in rail
 * Dir     : Analog input
 * NOTE    : V_in is on ADC2 because PA4 is not available on ADC1 for
 *           this package (§8.5).
 */
#define PIN_VS_MON_PORT      GPIOA
#define PIN_VS_MON_PIN       GPIO_PIN_4
#define ADC_CHANNEL_VS_MON   ADC_CHANNEL_17

/**
 * ID_MON — Output current sense (I_out, delivery current)
 * MCU pin : PC1 / ADC1_IN7
 * Net     : ID_MON (output.kicad_sch)
 * Physical: INA281A2 (U8) output; 12 mΩ shunt (R6), 50 V/V gain
 * Dir     : Analog input
 * Resolved: Round 3 Q2, confirmed from final.ioc pin labels (§3.3).
 */
#define PIN_ID_MON_PORT      GPIOC
#define PIN_ID_MON_PIN       GPIO_PIN_1
#define ADC_CHANNEL_ID_MON   ADC_CHANNEL_7

/**
 * IS_MON — Input current sense (I_in, source current)
 * MCU pin : PB0 / ADC1_IN15
 * Net     : IS_MON (input.kicad_sch)
 * Physical: INA293A2 (U6) output; 5 mΩ shunt (R25, confirmed physical
 *           inspection), 50 V/V gain
 * Dir     : Analog input
 * Resolved: Round 3 Q2 + Q3 — R25 = 5 mΩ (schematic shows 2 mΩ, stale).
 */
#define PIN_IS_MON_PORT      GPIOB
#define PIN_IS_MON_PIN       GPIO_PIN_0
#define ADC_CHANNEL_IS_MON   ADC_CHANNEL_15

/* =========================================================================
 * SECTION 2: COMPARATOR OUTPUT PIN
 * =========================================================================*/

/**
 * COMP1_OUT — Comparator 1 output (routes to HRTIM EEV4)
 * MCU pin : PA6
 * Net     : COMP1_OUT (dc-dc.kicad_sch)
 * Physical: COMP1 output pin; connects HRTIM external event 4 (EEV4)
 * Dir     : Digital output (from COMP1 peripheral)
 */
#define PIN_COMP1_OUT_PORT   GPIOA
#define PIN_COMP1_OUT_PIN    GPIO_PIN_6

/* =========================================================================
 * SECTION 3: HRTIM OUTPUT PIN MAPPINGS (Gate Drive Signals)
 * =========================================================================*/

/**
 * PHASE_1_P (CHA1) — Timer A Output 1, input-side high-side FET drive
 * MCU pin : PA8 / HRTIM1_CHA1
 * Net     : PHASE_1_P (dc-dc.kicad_sch)
 * Physical: uP1966E (U1) high-side input; drives Q1 (EPC2306/EPC2302)
 * Dir     : Digital output (HRTIM-controlled)
 * Buck    : Switches (Set=Period, Reset=EEV4)
 * Boost   : Static HIGH (forced)
 */
#define PIN_CHA1_PORT        GPIOA
#define PIN_CHA1_PIN         GPIO_PIN_8

/**
 * PHASE_1_N (CHA2) — Timer A Output 2, input-side low-side FET drive
 * MCU pin : PA9 / HRTIM1_CHA2
 * Net     : PHASE_1_N (dc-dc.kicad_sch)
 * Physical: uP1966E (U1) low-side input; drives Q2 (EPC2306/EPC2302)
 * Dir     : Digital output (HRTIM-controlled, complementary to CHA1)
 */
#define PIN_CHA2_PORT        GPIOA
#define PIN_CHA2_PIN         GPIO_PIN_9

/**
 * PHASE_2_P (CHB1) — Timer B Output 1, output-side high-side FET drive
 * MCU pin : PA10 / HRTIM1_CHB1
 * Net     : PHASE_2_P (dc-dc.kicad_sch)
 * Physical: uP1966E (U3) high-side input; drives Q3 (EPC2306/EPC2302)
 * Dir     : Digital output (HRTIM-controlled)
 * Buck    : Static HIGH (forced)
 * Boost   : Switches (Set=EEV4, Reset=Period)
 */
#define PIN_CHB1_PORT        GPIOA
#define PIN_CHB1_PIN         GPIO_PIN_10

/**
 * PHASE_2_N (CHB2) — Timer B Output 2, output-side low-side FET drive
 * MCU pin : PA11 / HRTIM1_CHB2
 * Net     : PHASE_2_N (dc-dc.kicad_sch)
 * Physical: uP1966E (U3) low-side input; drives Q4 (EPC2306/EPC2302)
 * Dir     : Digital output (HRTIM-controlled, complementary to CHB1)
 */
#define PIN_CHB2_PORT        GPIOA
#define PIN_CHB2_PIN         GPIO_PIN_11

/* =========================================================================
 * SECTION 4: HRTIM FAULT INPUT PIN MAPPINGS
 * =========================================================================*/

/**
 * VS_GOOD — Input voltage good signal (HRTIM FLT1)
 * MCU pin : PA12 / HRTIM1_FLT1
 * Net     : VS_GOOD (input.kicad_sch)
 * Physical: ADM1270ACPZ FAULT output or voltage supervisor on V_in rail
 * Dir     : Digital input, active-low (fault asserts when input goes LOW)
 * Effect  : Any assertion forces ALL HRTIM outputs to safe state (all FETs off)
 */
#define PIN_VS_GOOD_PORT     GPIOA
#define PIN_VS_GOOD_PIN      GPIO_PIN_12

/**
 * IS_GOOD — Input current good signal (HRTIM FLT2)
 * MCU pin : PA15 / HRTIM1_FLT2
 * Net     : IS_GOOD (input.kicad_sch, final.ioc label)
 * Physical: INA293A2 (U6) or ADM1270 overcurrent indicator
 * Dir     : Digital input, active-low (fault asserts when input goes LOW)
 * Resolved: Round 3 Q5 (§3.7).
 */
#define PIN_IS_GOOD_PORT     GPIOA
#define PIN_IS_GOOD_PIN      GPIO_PIN_15

/* =========================================================================
 * SECTION 5: POWER PATH CONTROL GPIO
 * =========================================================================*/

/**
 * INPUT_EN — Enables input power path
 * MCU pin : PC7
 * Net     : INPUT_EN (input.kicad_sch)
 * Physical: ADM1270 gate control or equivalent hot-swap enable signal
 * Dir     : GPIO output
 * Usage   : Assert HIGH before enabling switching; deassert on fault/shutdown.
 * TODO(hardware): Confirm active polarity from schematic during bring-up.
 */
#define PIN_INPUT_EN_PORT    GPIOC
#define PIN_INPUT_EN_PIN     GPIO_PIN_7

/**
 * OUTPUT_EN — Enables output power path
 * MCU pin : PC8
 * Net     : OUTPUT_EN
 * Physical: Output path enable signal (load disconnect or gate control)
 * Dir     : GPIO output
 * Usage   : Assert HIGH before switching; deassert on fault/shutdown.
 * TODO(hardware): Confirm active polarity from schematic during bring-up.
 */
#define PIN_OUTPUT_EN_PORT   GPIOC
#define PIN_OUTPUT_EN_PIN    GPIO_PIN_8

/**
 * OUTPUT_DIS — Disables/disconnects output path
 * MCU pin : PC9
 * Net     : OUTPUT_DIS
 * Physical: Output path disable/disconnect signal
 * Dir     : GPIO output
 * TODO(hardware): Confirm active polarity (active-high disable?) during
 *                 bring-up.  Assert during FAULT and IDLE states.
 */
#define PIN_OUTPUT_DIS_PORT  GPIOC
#define PIN_OUTPUT_DIS_PIN   GPIO_PIN_9

/* =========================================================================
 * SECTION 6: HRTIM TIMING CONSTANTS
 * =========================================================================*/

/**
 * HRTIM_PERIOD_COUNTS — HRTIM period register value; sets switching frequency.
 * Units  : HRTIM timer counts (183.82 ps/count at MUL32 prescaler)
 * Derive : 170 MHz × 32 / f_sw.  170e6 × 32 / 200e3 = 27 200 (exact). (§5.5)
 * Default: 200 kHz (5.0 µs period).
 * Target : 500 kHz → 10 880 counts.
 * Range  : [5440, 54400]   (100 kHz to 1 MHz)
 */
#define HRTIM_PERIOD_COUNTS             27200u

_Static_assert(HRTIM_PERIOD_COUNTS >= 5440u && HRTIM_PERIOD_COUNTS <= 54400u,
               "HRTIM_PERIOD_COUNTS out of valid range [5440, 54400]");

/**
 * HRTIM_BLANKING_TICKS_BUCK — Comparator blanking window in buck mode.
 * Units  : HRTIM ticks (183.82 ps/tick at MUL32 prescaler)
 * Derive : 100 ns / 183.82e-12 ≈ 544 ticks. (§5.5, §7.3)
 * Purpose: Suppress IL_MON ringing after the Period-reset switching edge
 *          so COMP1 does not false-trip on parasitic ringing.
 * Adjust : Empirically in range 100–500 ns (544–2720 ticks) using an
 *          oscilloscope on IL_MON.
 */
#define HRTIM_BLANKING_TICKS_BUCK       544u

/**
 * HRTIM_BLANKING_TICKS_BOOST — Comparator blanking window in boost mode.
 * Units  : HRTIM ticks (183.82 ps/tick at MUL32 prescaler)
 * Derive : 500 ns / 183.82e-12 ≈ 2720 ticks. (§5.5, §12.2)
 * Purpose: Must cover the bootstrap refresh pulse (200–500 ns) plus
 *          switching transient ringing.  Larger than buck because the
 *          boost refresh occupies the start of the period.
 */
#define HRTIM_BLANKING_TICKS_BOOST      2720u

_Static_assert(HRTIM_BLANKING_TICKS_BUCK  >= 544u  && HRTIM_BLANKING_TICKS_BUCK  <= 2720u,
               "HRTIM_BLANKING_TICKS_BUCK out of valid range [544, 2720]");
_Static_assert(HRTIM_BLANKING_TICKS_BOOST >= 1088u && HRTIM_BLANKING_TICKS_BOOST <= 5440u,
               "HRTIM_BLANKING_TICKS_BOOST out of valid range [1088, 5440]");

/**
 * MAX_DUTY_CYCLE_PCT — Maximum allowed charge-phase duty cycle.
 * Units  : percent of switching period
 * Derive : 85 % leaves ~750 ns at 200 kHz for the discharge phase and
 *          bootstrap refresh (≥200 ns).  Constraint: backstop_counts ≤
 *          period − refresh_ticks. 85 % × 27200 = 23120; 27200 − 1088 =
 *          26112 → 23120 < 26112 ✓  (§10.3)
 * Range  : [50, 96]
 */
#define MAX_DUTY_CYCLE_PCT              85u

_Static_assert(MAX_DUTY_CYCLE_PCT >= 50u && MAX_DUTY_CYCLE_PCT <= 96u,
               "MAX_DUTY_CYCLE_PCT out of valid range [50, 96]");

/**
 * MAX_ON_TIME_COUNTS — HRTIM Compare 1 value for hardware backstop.
 * Units  : HRTIM timer counts
 * Derive : HRTIM_PERIOD_COUNTS × MAX_DUTY_CYCLE_PCT / 100. (§10.3)
 *          27200 × 85 / 100 = 23120 counts at 200 kHz.
 * Purpose: Hardware Compare 1 match ends the charge phase if COMP1 (EEV4)
 *          has not fired by this point in the period.  Prevents unbounded
 *          inductor current ramp when COMP1 is inactive.
 */
#define MAX_ON_TIME_COUNTS              ((HRTIM_PERIOD_COUNTS) * (MAX_DUTY_CYCLE_PCT) / 100u)

/* =========================================================================
 * SECTION 7: SLOPE COMPENSATION TIMER (TIM6) CONSTANTS
 * =========================================================================*/

/**
 * TIM6_PRESCALER — TIM6 prescaler register value (PSC).
 * Units  : register value (0 = ÷1)
 * Derive : APBCLK / (PSC+1) / (ARR+1) = TIM6 rate.  PSC=0 → no division.
 *          (§7.3)
 */
#define TIM6_PRESCALER                  0u

/**
 * TIM6_PERIOD_COUNTS — TIM6 auto-reload register value (ARR).
 * Units  : timer counts
 * Derive : ARR = SYSCLK / TIM6_RATE_HZ − 1 = 170e6 / 2e6 − 1 = 84. (§7.3)
 *          Period = (PSC+1)(ARR+1)/170e6 = 1×85/170e6 = 500 ns = 2 MHz ✓
 */
#define TIM6_PERIOD_COUNTS              84u

/**
 * TIM6_RATE_HZ — Slope compensation timer interrupt rate.
 * Units  : Hz
 * Value  : 2 MHz (10 ticks per switching period at 200 kHz; 4 at 500 kHz)
 * Purpose: Drives DAC3 CH1 staircase ramp.  Rate >> f_sw ensures smooth
 *          ramp approximation (§7.5 CPU budget: ~10–30 cycles/ISR).
 */
#define TIM6_RATE_HZ                    2000000u

/* =========================================================================
 * SECTION 8: PID TIMER (TIM7) CONSTANTS
 * =========================================================================*/

/**
 * TIM7_PRESCALER — TIM7 prescaler register value (PSC).
 * Units  : register value (0 = ÷1)
 */
#define TIM7_PRESCALER                  0u

/**
 * TIM7_PERIOD_COUNTS — TIM7 auto-reload register value (ARR).
 * Units  : timer counts
 * Derive : ARR = SYSCLK / PID_EXECUTION_RATE_HZ − 1
 *          = 170e6 / 20e3 − 1 = 8499. (§8.2)
 *          Period = (0+1)(8499+1)/170e6 = 8500/170e6 = 50 µs = 20 kHz ✓
 */
#define TIM7_PERIOD_COUNTS              8499u

/**
 * PID_EXECUTION_RATE_HZ — Default PID outer-loop execution rate.
 * Units  : Hz
 * Range  : [1000, 500000]
 * Value  : 20 kHz (every 10th switching period at 200 kHz). (§8.2)
 */
#define PID_EXECUTION_RATE_HZ           20000u

_Static_assert(PID_EXECUTION_RATE_HZ >= 1000u && PID_EXECUTION_RATE_HZ <= 500000u,
               "PID_EXECUTION_RATE_HZ out of valid range [1000, 500000]");

/* =========================================================================
 * SECTION 9: NVIC PRIORITY ASSIGNMENTS
 * =========================================================================*/

/**
 * NVIC priority assignments (§13.2).
 * FreeRTOS configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY = 5 (confirmed IOC).
 * Regulator ISRs must be numerically less than 5 (higher urgency).
 * FreeRTOS API calls are prohibited from these ISRs.
 */

/** TIM6 (slope compensation) — most latency-sensitive; fires every 500 ns. */
#define NVIC_PRIORITY_SLOPE_COMP_TIM6   0u

/** HRTIM period + fault — must reload DAC before blanking window expires. */
#define NVIC_PRIORITY_HRTIM             1u

/** TIM7 (PID) and ADC completion — paired; must be below HRTIM. */
#define NVIC_PRIORITY_PID_TIM7          2u

