electricalhog/PD_Charger/STM32CubeIDE/final/Core/Inc/regulator_config.h
/** UCPD1 / PD stack — FreeRTOS-managed (confirmed IOC: priority 5). */
#define NVIC_PRIORITY_UCPD1             5u

/* =========================================================================
 * SECTION 10: PID CONTROLLER PARAMETERS
 * =========================================================================*/

/**
 * PID_OUTPUT_MIN — Minimum PID output (DAC counts).
 * Units  : DAC counts (0–4095)
 * Value  : 0  (zero current threshold → regulator effectively idle)
 */
#define PID_OUTPUT_MIN                  0

/**
 * PID_OUTPUT_MAX — Maximum PID output (DAC counts).
 * Units  : DAC counts (0–4095)
 * Derive : 4000 counts × 3.3 V / 4096 / 0.250 V·A⁻¹ ≈ 12.9 A peak
 *          inductor current.  Rationale: (§8.6)
 *            - DAC ceiling: 4095 → 13.2 A; PID_OUTPUT_MAX = 4000 leaves
 *              small margin below the DAC rail.
 *            - Inductor I_sat = 21 A (IHLP6767GZER4R7M11) → 4000 counts
 *              is 61 % of I_sat → adequate margin.
 *            - FET peak: EPC2306 = 200 A, EPC2302 = 400 A (Dan v0.1.2j)
 *              → FET peak far exceeds this ceiling; inductor saturation
 *              is the operative hardware constraint.
 * NOTE   : Peak *inductor* current ≠ output current.  In boost mode
 *          I_L_avg = I_out / (1−D); a 5 A output at D=0.75 requires
 *          I_L ≈ 20 A.  A 5 A inductor limit would prevent boost-mode
 *          operation entirely.
 */
#define PID_OUTPUT_MAX                  4000

_Static_assert(PID_OUTPUT_MAX > PID_OUTPUT_MIN && PID_OUTPUT_MAX <= 4095,
               "PID_OUTPUT_MAX must be in (PID_OUTPUT_MIN, 4095]");

/* =========================================================================
 * SECTION 11: VOLTAGE SETPOINT LIMITS
 * =========================================================================*/

/**
 * SETPOINT_MIN_MV — Minimum valid voltage setpoint.
 * Units  : millivolts
 * Value  : 5000 mV (USB PD SPR minimum, 5 V). (§9.2)
 */
#define SETPOINT_MIN_MV                 5000u

/**
 * SETPOINT_MAX_MV — Maximum valid voltage setpoint.
 * Units  : millivolts
 * Value  : 48000 mV (USB PD EPR maximum, 48 V). (§9.2)
 */
#define SETPOINT_MAX_MV                 48000u

/* =========================================================================
 * SECTION 12: SOFTWARE SAFETY THRESHOLDS
 * =========================================================================*/

/**
 * OVP_ABSOLUTE_MV — Absolute output overvoltage protection threshold.
 * Units  : millivolts
 * Derive : 110 % × 48 V EPR maximum = 52.8 V. (§10.2)
 *          Hardware ceiling is ADM1270 OVP at 60 V.
 * NOTE   : This is a compile-time constant — NOT runtime-tunable.
 *          It represents a hard safety limit below the hardware OVP.
 */
#define OVP_ABSOLUTE_MV                 52800u

/**
 * OVP_RELATIVE_PCT — Relative output overvoltage threshold (% of setpoint).
 * Units  : percent
 * Value  : 110  (10 % overshoot above setpoint triggers fault). (§10.2)
 * Range  : [105, 150]
 */
#define OVP_RELATIVE_PCT                110u

/**
 * UVP_RELATIVE_PCT — Relative output undervoltage threshold (% of setpoint).
 * Units  : percent
 * Value  : 50  (50 % below setpoint indicates loss of regulation). (§10.2)
 * Range  : [20, 90]
 */
#define UVP_RELATIVE_PCT                50u

/**
 * MODE_HYSTERESIS_MV — Hysteresis band around V_in ≈ V_out for mode selection.
 * Units  : millivolts
 * Value  : 1000 mV (1.0 V). (§5.1, Round 3 Q8)
 * Purpose: Prevents mode chattering when V_in ≈ V_setpoint.
 * Adjust : Empirically if chattering occurs near the buck/boost boundary.
 */
#define MODE_HYSTERESIS_MV              1000u

/**
 * BUCK_VIN_MARGIN_MV — Additional V_in margin required above V_out in buck mode.
 * Units  : millivolts
 * Value  : 500 mV (0.5 V guard band).
 * Purpose: Ensures the converter can maintain regulation in buck mode (§10.2).
 *          V_in_min(buck) = V_out_target + MODE_HYSTERESIS_MV (used for mode
 *          selection); BUCK_VIN_MARGIN_MV is the fault-trigger margin.
 * TODO(hardware): Verify this margin is sufficient at the actual operating
 *                 point during bring-up.
 */
#define BUCK_VIN_MARGIN_MV              500u

/**
 * BOOST_VIN_MARGIN_MV — Additional V_out margin required above V_in in boost mode.
 * Units  : millivolts
 * Value  : 500 mV (0.5 V guard band).
 * Purpose: Ensures the converter can maintain regulation in boost mode (§10.2).
 * TODO(hardware): Verify during bring-up.
 */
#define BOOST_VIN_MARGIN_MV             500u

/**
 * MAX_CONSECUTIVE_BACKSTOPS_DEFAULT — Default consecutive-backstop fault threshold.
 * Units  : count
 * Value  : 3 (runtime-mutable, see §10.4)
 * Range  : [1, 10]
 */
#define MAX_CONSECUTIVE_BACKSTOPS_DEFAULT  3u

/* =========================================================================
 * SECTION 13: SOFT-START PARAMETER
 * =========================================================================*/

/**
 * SOFT_START_RAMP_MS — Soft-start ramp duration.
 * Units  : milliseconds
 * Value  : 5 ms (advisory, not safety-critical; see §11.2)
 * Derive : Sets setpoint ramp from 0 to V_target over this interval.
 *          At 20 kHz PID rate = 100 ramp steps.
 */
#define SOFT_START_RAMP_MS              5u

/* =========================================================================
 * SECTION 14: ADC SCALING CONSTANTS
 * =========================================================================*/

/**
 * ADC_FULL_SCALE_COUNTS — 12-bit ADC full-scale value.
 * Units  : ADC counts
 * Value  : 4096 (2^12)
 */
#define ADC_FULL_SCALE_COUNTS           4096u

/**
 * VREF_MV — ADC voltage reference.
 * Units  : millivolts
 * Value  : 3300 mV (V_DDA = 3.3 V)
 */
#define VREF_MV                         3300u

/**
 * ADC_VOLTAGE_FULL_SCALE_MV — Full-scale physical voltage for VD_MON / VS_MON.
 * Units  : millivolts
 * Derive : Divider ratio = R_low / (R_high + R_low)
 *          = 5820 / (100000 + 5820) = 5820 / 105820 = 0.05500.
 *          ADC full-scale = 3.3 V → full-scale physical voltage =
 *          3.3 V / 0.05500 = 60.0 V.  (§3.4, Appendix D)
 *          Scaling: V_mV = ADC_raw × 60000 / 4096 ≈ 14.65 mV/count.
 */
#define ADC_VOLTAGE_FULL_SCALE_MV       60000u

/**
 * ADC_IL_FULL_SCALE_MA — Full-scale physical current for IL_MON / IS_MON.
 * Units  : milliamps
 * Derive : Sensitivity = R_shunt × Gain = 5 mΩ × 50 = 250 mV/A.
 *          ADC full-scale = 3.3 V → full-scale current = 3.3 / 0.250 = 13.2 A.
 *          Scaling: I_mA = ADC_raw × 13200 / 4096 ≈ 3.22 mA/count.
 *          (§3.3, §6.2, Appendix D)
 */
#define ADC_IL_FULL_SCALE_MA            13200u

/**
 * ADC_ID_FULL_SCALE_MA — Full-scale physical current for ID_MON.
 * Units  : milliamps
 * Derive : Sensitivity = 12 mΩ × 50 = 600 mV/A.
 *          Full-scale = 3.3 / 0.600 = 5.5 A.
 *          Scaling: I_mA = ADC_raw × 5500 / 4096 ≈ 1.34 mA/count.
 *          (§3.3, Appendix D)
 */
#define ADC_ID_FULL_SCALE_MA            5500u

/* =========================================================================
 * SECTION 15: DAC3 SCALING CONSTANTS (Slope Compensation / Current Setpoint)
 * =========================================================================*/

/**
 * DAC_FULL_SCALE_COUNTS — 12-bit DAC full-scale value.
 * Units  : DAC counts
 * Value  : 4096 (2^12); maximum usable count = 4095.
 */
#define DAC_FULL_SCALE_COUNTS           4096u

/**
 * DAC_COUNTS_PER_AMP — DAC counts per ampere of peak inductor current.
 * Units  : counts / A
 * Derive : I_peak × Sensitivity / (V_REF / DAC_counts)
 *          = I_peak × 0.250 V/A / (3.3 V / 4096)
 *          = I_peak × 0.250 / 0.000806
 *          ≈ 310.2 counts/A  →  use 310 counts/A for integer math. (§6.2)
 * NOTE   : Direction is: more DAC counts → higher comparator threshold →
 *          higher peak current before COMP1 trips.
 */
#define DAC_COUNTS_PER_AMP              310u

/**
 * SLOPE_STEP_NUMERATOR — Numerator for slope-step integer computation.
 * SLOPE_STEP_DENOMINATOR — Denominator for slope-step integer computation.
 *
 * Purpose: At each TIM6 tick, DAC3 CH1 decreases by step_counts, where:
 *   step_counts = V_out_V / L_H × DAC_COUNTS_PER_AMP / TIM6_RATE_HZ   (buck)
 *              = V_out_mV × DAC_COUNTS_PER_AMP / (L_uH × TIM6_RATE_HZ × 1000)
 *
 * For integer arithmetic:
 *   step_counts = V_out_mV × SLOPE_STEP_NUMERATOR / SLOPE_STEP_DENOMINATOR
 *
 * Derive: L = 4.7 µH = 4700 nH.
 *   step = V_out_mV × 310 / (4700 × 2000000 / 1000)
 *        = V_out_mV × 310 / 9400000
 *        = V_out_mV × 31 / 940000
 *
 * At V_out = 20 V = 20000 mV:  step = 20000 × 31 / 940000 = 0.66 → rounds to 1.
 * NOTE: This gives approximately 1 count/tick at 20 V. The spec says the
 * exact slope formula uses floating-point for pre-computation (§7.2); the
 * ISR itself only subtracts the precomputed integer step value.
 *
 * Cross-check at 20 V: step_float = (20/4.7e-6) × 310.2 / 2e6 = 0.660.
 * Integer approximation: 20000 × 31 / 940000 = 0.66 → truncates to 0!
 *
 * TODO: For a more accurate integer formula, scale the numerator/denominator.
 * Recommend: step_counts = (uint32_t)(V_out_mv * 33) / 1000000;
 * Cross-check: 20000 × 33 / 1000000 = 0.66 → still 0 with integer division.
 * The correct approach is floating-point pre-computation in pid_isr (§7.2):
 *   slope_comp_update_step() computes step_counts as a float, then stores
 *   the integer floor. Values < 1 should map to 1 to ensure the ramp moves.
 *
 * (§7.2, §7.3, Appendix E)
 */
#define INDUCTOR_VALUE_UH               4u      /* 4.7 µH, integer part; use float in slope_comp.c */
#define INDUCTOR_VALUE_UH_TENTHS        7u      /* fractional tenth (4.7 µH) */

/* =========================================================================
 * SECTION 16: POWER STAGE HARDWARE PARAMETERS
 * =========================================================================*/

/**
 * These are reference constants for documentation/assertion purposes.
 * They are not used in computation directly but anchor the scaling constants
 * in §14–§15 to their physical basis.
 */

/** Inductor value (IHLP6767GZER4R7M11) in nanohenries. */
#define INDUCTOR_VALUE_NH               4700u

/** Inductor saturation current in milliamps (Vishay datasheet; Round 3 Q7). */
#define INDUCTOR_ISAT_MA                21000u

/** Input shunt R25 in milliohms (physical inspection, [Jonah]; §3.3). */
#define INPUT_SHUNT_R25_MOHM            5u

/** Inductor shunt R5 in milliohms (schematic; §3.3). */
#define INDUCTOR_SHUNT_R5_MOHM          5u

/** Output shunt R6 in milliohms (schematic; §3.3). */
#define OUTPUT_SHUNT_R6_MOHM            12u

/** Current-sense amplifier gain for all three shunts (INA281A2, INA293A2). */
#define CURRENT_SENSE_AMP_GAIN_VV       50u

#ifdef __cplusplus
}
#endif

#endif /* REGULATOR_CONFIG_H */
